# Obtaining Your Data - Lab

## Introduction
In this lab you'll practice your munging and transforming skills in order to load in your data to solve a regression problem.

## Objectives
You will be able to:
* Perform an ETL process with multiple tables and create a single dataset

## Task Description

You just got hired by Lego! Your first project is going to be to develop a pricing algorithm to help set a target price for new lego sets that are released to market. To do this, you're first going to need to start mining the company database in order to collect the information you need to develop a model.

Start by investigating the database stored in lego.db and joining the tables into a unified dataset!

> **Hint:** use this SQL query to preview the tables in an unknown database:
```sql
SELECT name FROM sqlite_master
            WHERE type='table'
            ORDER BY name;
```

In [1]:
import sqlite3
import pandas as pd

In [4]:
conn = sqlite3.connect('lego.db')

In [14]:
q0 = """
SELECT *
FROM sqlite_master
;
"""
pd.read_sql(q0, conn)

,type,name,tbl_name,rootpage,sql
0,table,product_info,product_info,2,CREATE TABLE product_info (prod_id INTEGER PRI...
1,table,product_pricing,product_pricing,3,CREATE TABLE product_pricing (prod_id INTEGER ...
2,index,sqlite_autoindex_product_pricing_1,product_pricing,4,None
3,table,product_details,product_details,5,CREATE TABLE product_details (prod_id INTEGER ...
4,table,product_reviews,product_reviews,6,CREATE TABLE product_reviews (prod_id INTEGER ...

In [13]:
q0 = """
SELECT *
FROM product_details
WHERE prod_id=630;
"""
pd.read_sql(q0, conn)

   prod_id prod_desc prod_long_desc theme_name
0      630      blah       blahblah    Classic

In [12]:
q0 = """
SELECT *
FROM product_info
WHERE prod_id=630;
"""
pd.read_sql(q0, conn)

   prod_id ages  piece_count         set_name
0      630   4+            1  Brick Separator

In [10]:
q0 = """
SELECT *
FROM product_pricing
WHERE prod_id=630;
"""
pd.read_sql(q0, conn)

    prod_id country          list_price
0       630      AT  3.0378000000000003
1       630      AU              2.2724
2       630      BE  3.0378000000000003
3       630      CA  2.3322000000000003
4       630      CH               2.958
5       630      CZ  3.3120000000000003
6       630      DE  3.0378000000000003
7       630      DN                 2.4
8       630      ES  3.0378000000000003
9       630      FI               3.599
10      630      FR  3.0378000000000003
11      630      GB               2.786
12      630      IE  3.0378000000000003
13      630      IT  3.0378000000000003
14      630      LU  3.0378000000000003
15      630      NL  3.0378000000000003
16      630      NO                3.12
17      630      NZ              3.5429
18      630      PL              2.8971
19      630      PT  3.0378000000000003
20      630      US                2.49

In [11]:
q0 = """
SELECT *
FROM product_reviews
WHERE prod_id=630;
"""
pd.read_sql(q0, conn)

,prod_id,num_reviews,play_star_rating,review_difficulty,star_rating,val_star_rating
0,630,180,4.0,Very Easy,4.8,4.6

## Summary
Nice work! You're working more and more independently through the workflow and ensuring data integrity! In this lab, you successfully executed an ETL process to merge different tables!